export default Object.assign({
  0: {
    1: {
      1.1: "Year0",
      "1.1.1": "I",
      "1.1.2": "am",
      "1.1.3": "Testing",
    },
  },
  1: {
    1: {
      1.1: {
        en: "Positions",
        zh: "位置",
      },
      "1.1.1": {
        en: "left, right and next to",
        zh: "左、右和之間",
      },
      "1.1.2": "上、下和之間",
      "1.1.3": "前、後和之間",
    },
    2: {
      1.2: {
        en: "Numbers Up to 20",
        zh: "20 以內的數",
      },
      "1.2.1": "認識20以內的數",
      "1.2.2": "多和少",
      "1.2.3": "順數和倒數",
      "1.2.4": "單數和雙數",
      "1.2.5": "次序和數量",
    },
    3: {
      1.3: {
        en: "Decomposition and Composition of Numbers",
        zh: "數的分和合",
      },
      "1.3.1": "2 至 5 各數的分和合",
      "1.3.2": "6 至 10 各數的分和合",
      "1.3.3": "11 至 14 各數的分和合",
      "1.3.4": "15 至 18 各數的分和合",
    },
    4: {
      1.4: {
        en: "Length and Distance",
        zh: "長度和距離",
      },
      "1.4.1": "認識及直觀比較",
      "1.4.2": "並排比較",
      "1.4.3": "以自訂單位來比較長度",
      "1.4.4": "認識及比較",
    },
    5: {
      1.5: {
        en: "Basic Addition",
        zh: "加法的認識",
      },
      "1.5.1": "加法的基本概念",
      "1.5.2": "18以內的加法",
      "1.5.3": "交換位置",
    },
    6: {
      1.6: {
        en: "Basic Subtraction",
        zh: "減法的認識",
      },
      "1.6.1": "減法的基本概念",
      "1.6.2": "18以內的減法",
      "1.6.3": "0的概念和計算",
      "1.6.4": "加法和減法的關係",
    },
    7: {
      1.7: {
        en: "Numbers Up to 100",
        zh: "100 以內的數",
      },
      "1.7.1": "21至50的認識",
      "1.7.2": "51至100的認識",
      "1.7.3": "順數和倒數",
      "1.7.4": "個位和十位",
      "1.7.5": "比較100以內的數",
    },
    8: {
      1.8: {
        en: "Sorting Methods",
        zh: "數數方法",
      },
      "1.8.1": "每2個一數",
      "1.8.2": "每5個、10個一數",
      "1.8.3": "估計物件的數量",
    },
    9: {
      1.9: {
        en: "Time",
        zh: "時間",
      },
      "1.9.1": "認識時鐘",
      "1.9.2": "以「時正」報時",
      "1.9.3": "以「時半」報時",
      "1.9.4": "認識「小時」",
      "1.9.5": "結束時間",
      "1.9.6": "過了多久",
    },
    10: {
      "1.10": {
        en: "Date",
        zh: "日期",
      },
      "1.10.1": "認識星期",
      "1.10.11": "認識一年的 12 個月",
    },
    11: {
      1.11: {
        en: "3-D shapes",
        zh: "立體圖形",
      },
      "1.11.1": "認識立體圖形",
      "1.11.2": "立體圖形的分類",
    },
    12: {
      1.12: {
        en: "2-D shapes",
        zh: "平面圖形的拼砌",
      },
      "1.12.1": "認識點、直線和曲線",
      "1.12.2": "製作及繪畫直線和曲線.",
      "1.12.3": "經過兩點的線",
      "1.12.4": "認識平面圖形",
      "1.12.5": "製作及繪畫平面圖形",
      "1.12.6": "平面圖形的拼砌",
    },
    13: {
      1.13: {
        en: "Addition",
        zh: "加法",
      },
      "1.13.1": "兩位數以內的不進位加法",
      "1.13.2": "兩位數以內的進位加法",
      "1.13.3": "解答加法應用題",
      "1.13.4": "單數和雙數相加的規律",
      "1.13.5": "三個數的加法",
      "1.13.6": "奇妙的加法.",
    },
    14: {
      1.14: {
        en: "Subtraction, and Word Problems involving addition and subtraction",
        zh: "減法及加減應用題",
      },
      "1.14.1": "兩位數以內的不退位減法",
      "1.14.2": "解答減法應用題",
      "1.14.3": "分辨和解答加減應用題",
    },
    15: {
      1.15: {
        en: "Centimeters",
        zh: "厘米",
      },
      "1.15.1": "認識厘米",
      "1.15.2": "利用厘米尺來量度",
      "1.15.3": "量度曲線的方法",
      "1.15.4": "適當的工具",
      "1.15.5": "永備尺",
    },
    16: {
      1.16: {
        en: "Hong Kong Coins",
        zh: "香港的硬幣",
      },
      "1.16.1": "認識香港的硬幣",
      "1.16.2": "硬幣的總值",
      "1.16.3": "硬幣的互換",
      "1.16.4": "價錢牌",
      "1.16.5": "怎樣付款",
    },
  },
  2: {
    1: {
      2.1: {
        en: "3-digit Numbers",
        zh: "三位數",
      },
      "2.1.1": {
        en: "Understanding three-digit numbers",
        zh: "认识三位数",
      },
      "2.1.2": {
        en: "Counting forward and backward, odd and even numbers",
        zh: "顺数和倒数、单数和",
      },
      "2.1.3": {
        en: "Comparison",
        zh: "比较",
      },
      "2.1.4": {
        en: "Counting",
        zh: "数数",
      },
      "2.1.5": {
        en: "Estimating the quantity of objects",
        zh: "估计物件的数量",
      },
    },
    2: {
      2.2: {
        en: "Addition",
        zh: "加法",
      },
      "2.2.1": {
        en: "Addition without carrying within three digits",
        zh: "三位数以內的不進位加法",
      },
      "2.2.2": {
        en: "Estimating the result",
        zh: "估计计算结果",
      },
      "2.2.3": {
        en: "Addition with carrying within three digits",
        zh: "三位数以內的進位加法",
      },
      "2.2.4": {
        en: "Addition of three numbers",
        zh: "三個數的加法",
      },
      "2.2.5": {
        en: "Solving addition word problems",
        zh: "解答加法應用題",
      },
    },
    3: {
      2.3: {
        en: "Subtraction, and Word Problems involving addition and subtraction",
        zh: "減法及加減應用題",
      },
      "2.3.1": {
        en: "Subtraction within two digits",
        zh: "两位数以内的减法",
      },
      "2.3.2": {
        en: "Estimating the result",
        zh: "估计计算结果",
      },
      "2.3.3": {
        en: "Subtraction of three numbers",
        zh: "三个数的减法",
      },
      "2.3.4": {
        en: "Solving subtraction word problems",
        zh: "解答減法應用題",
      },
      "2.3.5": {
        en: "Identifying and solving addition-subtraction word problems",
        zh: "分辨和解答加減應用題",
      },
    },
    4: {
      2.4: {
        en: "Angles & Perpendicular Lines",
        zh: "角和垂直線",
      },
      "2.4.1": {
        en: "Understanding angles",
        zh: "認識角",
      },
      "2.4.2": {
        en: "Comparing the size of angles",
        zh: "比较角的大小",
      },
      "2.4.3": {
        en: "Right angles",
        zh: "直角",
      },
      "2.4.4": {
        en: "Acute and obtuse angles",
        zh: "锐角和钝角",
      },
      "2.4.5": {
        en: "Constructing and drawing angles",
        zh: "製作及繪畫角",
      },
      "2.4.6": {
        en: "Understanding and drawing perpendicular lines",
        zh: "認識及繪畫垂直线",
      },
    },
    5: {
      2.5: {
        en: "Direction",
        zh: "方向",
      },
      "2.5.1": {
        en: "Recognizing the four main directions and directions",
        zh: "認識四個主要方向和方向的",
      },
      "2.5.2": {
        en: "Finding directions using a compass",
        zh: "利用指南針找方向",
      },
      "2.5.3": {
        en: "Position, direction, and route",
        zh: "位置、方向和路線",
      },
    },
    6: {
      2.6: {
        en: "Basic Multiplication I",
        zh: "基本乘法（一）",
      },
      "2.6.1": {
        en: "Adding the same number",
        zh: "同数相加",
      },
      "2.6.2": {
        en: "Concept of multiplication",
        zh: "乘法概念",
      },
      "2.6.3": {
        en: "Multiplication of 10 and 5",
        zh: "10 和 5 的乘法",
      },
      "2.6.4": {
        en: "Multiplication of 2, 3, and 4",
        zh: "2、3 和 4 的乘法",
      },
      "2.6.5": {
        en: "Magical 0 and 1",
        zh: "奇妙的 0 和 1",
      },
      "2.6.6": {
        en: "Solving multiplication word problems",
        zh: "解答乘法應用題",
      },
    },
    7: {
      2.7: {
        en: "Basic Multiplication II",
        zh: "基本乘法（二）",
      },
      "2.7.1": {
        en: "Multiplication of 6, 7, 8, and 9",
        zh: "6、7、8 和 9 的乘法",
      },
      "2.7.2": {
        en: "Interesting multiplication",
        zh: "有趣的乘法",
      },
      "2.7.3": {
        en: "Solving multiplication word problems",
        zh: "解答乘法應用題",
      },
      "2.7.4": {
        en: "Identifying and solving multiplication word problems",
        zh: "分辨和解答應用題",
      },
    },
    8: {
      2.8: {
        en: "Time",
        zh: "時間",
      },
      "2.8.1": {
        en: "Telling time in hours and minutes",
        zh: "以「時」和「分」报时",
      },
      "2.8.2": {
        en: "Understanding minutes",
        zh: "認識「分鐘」",
      },
      "2.8.3": {
        en: "Elapsed time",
        zh: "过了多久",
      },
      "2.8.4": {
        en: "Ending time",
        zh: "結束時間",
      },
      "2.8.5": {
        en: "Understanding a day's time",
        zh: "認識一天的時間",
      },
    },
    9: {
      2.9: {
        en: "Date",
        zh: "日期",
      },
      "2.9.1": {
        en: "Number of days in a month",
        zh: "每月的日數",
      },
      "2.9.2": {
        en: "Leap years and non-leap years",
        zh: "平年和閏年",
      },
      "2.9.3": {
        en: "Ending date",
        zh: "結束日期",
      },
      "2.9.4": {
        en: "Number of days used, starting date",
        zh: "所用的日數、開始日期",
      },
    },
    10: {
      "2.10": {
        en: "3-D Shapes",
        zh: "立體圖形",
      },
      "2.10.1": {
        en: "Faces of a prism",
        zh: "角柱的面",
      },
      "2.10.2": {
        en: "Faces of a pyramid",
        zh: "角錐的面",
      },
      "2.10.3": {
        en: "Faces of a cylinder, cone, and sphere",
        zh: "圓柱、圓錐和球的面",
      },
    },
    11: {
      2.11: {
        en: "4-digit Numbers",
        zh: "四位數",
      },
      "2.11.1": {
        en: "Understanding four-digit numbers",
        zh: "認識四位數",
      },
      "2.11.2": {
        en: "Counting forward and backward, odd and even numbers",
        zh: "順數和倒數、單數和雙數",
      },
      "2.11.3": {
        en: "Comparison",
        zh: "比較大小",
      },
      "2.11.4": {
        en: "Counting activities",
        zh: "數數活動",
      },
    },
    12: {
      2.12: {
        en: "Hong Kong Currency",
        zh: "香港的貨幣",
      },
      "2.12.1": {
        en: "Recognizing Hong Kong banknotes",
        zh: "認識香港的紙幣",
      },
      "2.12.2": {
        en: "Total value of currency",
        zh: "貨幣的總值",
      },
      "2.12.3": {
        en: "Currency conversion",
        zh: "貨幣的互換",
      },
      "2.12.4": {
        en: "Price tags",
        zh: "價錢牌",
      },
      "2.12.5": {
        en: "Methods of payment",
        zh: "怎樣付款",
      },
      "2.12.6": {
        en: "Paying with the least amount of currency",
        zh: "以最少的貨幣數量付款",
      },
    },
    13: {
      2.13: {
        en: "Subtraction",
        zh: "減法",
      },
      "2.13.1": {
        en: "Subtraction without borrowing",
        zh: "不退位減法",
      },
      "2.13.2": {
        en: "Subtraction with borrowing",
        zh: "退位減法",
      },
      "2.13.3": {
        en: "Solving subtraction word problems",
        zh: "解答減法應用題",
      },
      "2.13.4": {
        en: "Solving currency calculation word problems",
        zh: "解答貨幣計算應用題",
      },
    },
    14: {
      2.14: {
        en: "Mixed Operations of Addition and Subtraction",
        zh: "加減混合計算",
      },
      "2.14.1": {
        en: "Mixed addition and subtraction",
        zh: "加減混合計算",
      },
      "2.14.2": {
        en: "Solving mixed addition and subtraction word problems",
        zh: "解答加減混合計算應用法",
      },
      "2.14.3": {
        en: "Identifying and solving addition-subtraction word problems",
        zh: "分辨和解答加減應用題",
      },
    },
    15: {
      2.15: {
        en: "Metre and Centimetre",
        zh: "米和厘米",
      },
      "2.15.1": {
        en: "Recognizing meters",
        zh: "認識米",
      },
      "2.15.2": {
        en: "Choosing units of length",
        zh: "長度單位的選擇",
      },
      "2.15.3": {
        en: "Measuring with a meter stick",
        zh: "利用米尺來量度",
      },
      "2.15.4": {
        en: "Different measuring tools",
        zh: "不同的量度工具",
      },
      "2.15.5": {
        en: "Yardstick",
        zh: "永備尺",
      },
    },
    16: {
      2.16: {
        en: "Sharing and Grouping",
        zh: "分物活動",
      },
      "2.16.1": {
        en: "Equal sharing",
        zh: "平均分物",
      },
      "2.16.2": {
        en: "Grouping and sharing",
        zh: "分组分物",
      },
      "2.16.3": {
        en: "Sharing with remainders",
        zh: "分不盡",
      },
      "2.16.4": {
        en: "Exploring the remaining quantity",
        zh: "餘下數量的探究",
      },
    },
    17: {
      2.17: {
        en: "Basic Division",
        zh: "基本除法",
      },
      "2.17.1": {
        en: "Sharing and division expressions",
        zh: "分物與除式",
      },
      "2.17.2": {
        en: "Multiplication and division",
        zh: "乘和除",
      },
      "2.17.3": {
        en: "Computing division",
        zh: "計算除法",
      },
      "2.17.4": {
        en: "Computing division with remainders",
        zh: "計算有餘數的除法",
      },
      "2.17.5": {
        en: "Solving division word problems",
        zh: "解答除法應用題",
      },
      "2.17.6": {
        en: "Identifying and solving division word problems",
        zh: "分辨和解答應用題",
      },
    },
    18: {
      2.18: {
        en: "Line segments & Quadrilaterals",
        zh: "線段和四邊形",
      },
      "2.18.1": {
        en: "Recognizing line segments",
        zh: "認識線段",
      },
      "2.18.2": {
        en: "Edges and angles of quadrilaterals",
        zh: "四邊形的邊和角",
      },
      "2.18.3": {
        en: "Recognizing squares and rectangles",
        zh: "認識正方形和長方形",
      },
      "2.18.4": {
        en: "Constructing and drawing squares and rectangles",
        zh: "製作及繪畫正方形和長方形",
      },
    },
    // 19: {
    //   2.19: {
    //     en: "Pictograms",
    //     zh: "象形圖",
    //   },
    //   "2.19.1": {
    //     en: "Reading pictographs",
    //     zh: "閱讀象形圖",
    //   },
    //   "2.19.2": {
    //     en: "Different types of pictographs",
    //     zh: "不同類型的象形圖",
    //   },
    //   "2.19.3": {
    //     en: "Creating pictographs",
    //     zh: "製作象形圖",
    //   },
    // },
  },
  3: {
    1: {
      3.1: {
        en: "5-digits Numbers",
        zh: "五位數",
      },
      "3.1.1": "認識五位數",
      "3.1.2": "順數和倒數、單數和雙數",
      "3.1.3": "比較大小",
    },
    2: {
      3.2: {
        en: "Kilometer and Millimeter",
        zh: "公里和毫米",
      },
      "3.2.1": "認識公里",
      "3.2.2": "以「公里」來比較長度",
      "3.2.3": "認識毫米",
      "3.2.4": "以「毫米」來記錄和比較長度",
      "3.2.5": "合適的長度單位",
    },
    3: {
      3.3: {
        en: "Multiplication",
        zh: "乘法",
      },
      "3.3.1": "乘法基礎",
      "3.3.2": "兩位數與一位數的乘法",
      "3.3.3": "估計計算結果",
      "3.3.4": "三位數與一位數的乘法",
      "3.3.5": "三個數的乘法",
      "3.3.6": "解答乘法應用題",
      "3.3.7": "分辨和解答應用題",
    },
    4: {
      3.4: {
        en: "Time",
        zh: "時間",
      },
      "3.4.1": "過了多久、結束時間",
      "3.4.2": "開始時間",
      "3.4.3": "認識「秒」",
      "3.4.4": "過了多少秒",
    },
    5: {
      3.5: {
        en: "Division",
        zh: "除法",
      },
      "3.5.1": "兩位數除以一位數",
      "3.5.2": "三位數除以一位數",
      "3.5.3": "三個數的除法",
      "3.5.4": "解答除法應用題",
      "3.5.5": "分辨和解答應用題",
    },
    6: {
      3.6: {
        en: "Weight",
        zh: "重量",
      },
      "3.6.1": "輕和重",
      "3.6.2": "直接比較重量",
      "3.6.3": "以自訂單位比較重量",
      "3.6.4": "認識克和公斤",
      "3.6.5": "用磅來稱量物件",
      "3.6.6": "選擇合適的量度工具",
    },
    7: {
      3.7: {
        en: "Parallel Lines & Quadrilaterals",
        zh: "平行線和四邊形",
      },
      "3.7.1": "平行線",
      "3.7.2": "認識平行四邊形",
      "3.7.3": "製作及繪畫平行四邊形",
      "3.7.4": "認識梯形",
      "3.7.5": "製作及繪畫梯形",
    },
    8: {
      3.8: {
        en: "24-hour Time",
        zh: "小時報時制",
      },
      "3.8.1": "「12 小時報時制」和「24 小時報時制」",
      "3.8.2": "以「24 小時報時制」報時",
    },
    9: {
      3.9: {
        en: "Mixed Operations of Addition and Subtraction",
        zh: "加減混合計算",
      },
      "3.9.1": "認識及運用圓括號",
      "3.9.2": "加減混合計算",
      "3.9.3": "解答三個數的加減應用題",
    },
    10: {
      "3.10": {
        en: "Mixed Operations of multiplication with addition and subtraction",
        zh: "乘加和乘減混合計算",
      },
      "3.10.1": "乘加混合計算",
      "3.10.2": "乘減混合計算",
      "3.10.3": "乘加和乘減混合計算應用題",
      "3.10.4": "分辨和解答兩步運算的應用題",
    },
    11: {
      3.11: {
        en: "Triangles",
        zh: "三角形",
      },
      "3.11.1": "認識三角形",
      "3.11.2": "不同種類的三角形",
      "3.11.3": "三角形的角",
      "3.11.4": "製作及繪畫三角形",
    },
    12: {
      3.12: {
        en: "Fractions",
        zh: "分數的認識",
      },
      "3.12.1": "一個物件的幾分之幾",
      "3.12.2": "一組物件的幾分之幾",
      "3.12.3": "比較分數的大小",
      "3.12.4": "等值分數",
    },
    13: {
      3.13: {
        en: "Addition & Subtraction of Fractions with same denominator",
        zh: "同分母分數加減",
      },
      "3.13.1": "同分母分數的加法",
      "3.13.2": "同分母分數的減法",
    },
    14: {
      3.14: {
        en: "Capacity",
        zh: "容量",
      },
      "3.14.1": "直觀和直接比較容量",
      "3.14.2": "間接比較容量",
      "3.14.3": "以自訂單位比較容量",
      "3.14.4": "認識毫升和升",
      "3.14.5": "用量杯量度容量",
    },
    15: {
      3.15: {
        en: "Bar Graphs",
        zh: "棒形圖",
      },
      "3.15.1": "認識及閱讀棒形圖",
      "3.15.2": "閱讀一格代表 2 或 5 個單位的棒形圖",
      "3.15.3": "收集數據和製作頻數表",
      "3.15.4": "製作棒形圖",
    },
  },
  4: {
    1: {
      4.1: {
        en: "Multiplication",
        zh: "乘法",
      },
      "4.1.1": "認識乘法的性質",
      "4.1.2": "乘以整十數",
      "4.1.3": "兩位數的乘法",
      "4.1.4": "三位數與兩位數相乘",
      "4.1.5": "快捷的乘法計算",
      "4.1.6": "乘法應用題",
      "4.1.7": "乘加和乘減混合計算的應用題",
    },
    2: {
      4.2: {
        en: "Division",
        zh: "除法",
      },
      "4.2.1": "兩位數除以整十數",
      "4.2.2": "兩位數除以兩位數",
      "4.2.3": "三位數除以兩位數",
      "4.2.4": "除法應用題",
      "4.2.5": "認識整除性",
      "4.2.6": "2 的整除性",
      "4.2.7": "5 和 10 的整除性",
      "4.2.8": "3 的整除性",
    },
    3: {
      4.3: {
        en: "Quadrilaterals",
        zh: "四邊形",
      },
      "4.3.1": "認識菱形",
      "4.3.2": "製作及繪畫菱形",
      "4.3.3": "四邊形的特性",
      "4.3.4": "正方形和長方形的關係",
      "4.3.5": "正方形和菱形的關係",
      "4.3.6": "正方形、長方形、菱形與平行四邊形的關係",
    },
    4: {
      4.4: {
        en: "Dissecting and Forming Shapes",
        zh: "圖形分割和拼砌",
      },
      "4.4.1": "圖形的分割",
      "4.4.2": "圖形的拼砌",
      "4.4.3": "分割及拼砌圖形",
    },
    5: {
      4.5: {
        en: "Multiples & Factors",
        zh: "倍數和因數",
      },
      "4.5.1": "認識倍數",
      "4.5.2": "認識因數",
      "4.5.3": "找出因數",
      "4.5.4": "比較因數的數量",
      "4.5.5": "因數和倍數的關係",
      "4.5.6": "認識質數和合成數",
      "4.5.7": "100 以內的質數",
    },
    6: {
      4.6: {
        en: "Common Factors & Common Multiples",
        zh: "公因數和公倍數",
      },
      "4.6.1": "認識公因數和最大公因數",
      "4.6.2": "用短除法找出最大公因數",
      "4.6.3": "認識公倍數和最小公倍數",
      "4.6.4": "公倍數和最小公倍數的關係",
      "4.6.5": "用短除法找出最小公倍數",
    },
    7: {
      4.7: {
        en: "The Eight Directions",
        zh: "八個方向",
      },
      "4.7.1": "認識八個方向",
      "4.7.2": "用指南針測方向",
      "4.7.3": "位置、方向和路線",
    },
    8: {
      4.8: {
        en: "Bar Charts",
        zh: "棒形圖",
      },
      "4.8.1": "認識數據較大的棒形圖",
      "4.8.2": "閱讀數據較大的棒形圖",
      "4.8.3": "近似值",
      "4.8.4": "製作一格代表 10 個單位的棒形圖",
      "4.8.5": "製作數據較大的棒形圖",
    },
    9: {
      4.9: {
        en: "Four Arithmetic Operations",
        zh: "四則混合計算",
      },
      "4.9.1": "除加混合計算",
      "4.9.2": "除減混合計算",
      "4.9.3": "除乘混合計算",
      "4.9.4": "四則混合計算",
      "4.9.5": "四則混合計算應用題",
    },
    10: {
      "4.10": {
        en: "Perimeter",
        zh: "周界",
      },
      "4.10.1": "閉合圖形和周界",
      "4.10.2": "量度及比較平面圖形的周界",
      "4.10.3": "正方形周界的計算",
      "4.10.4": "正方形周界的應用題",
      "4.10.5": "長方形周界的計算",
      "4.10.6": "關長方形周界的應用題",
      "4.10.7": "圖形的周界",
    },
    11: {
      4.11: {
        en: "Area",
        zh: "面積",
      },
      "4.11.1": "認識面積",
      "4.11.2": "直觀和直接比較面積",
      "4.11.3": "以自訂單位比較面積",
      "4.11.4": "認識平方厘米和平方米",
      "4.11.5": "長方形面積的計算",
      "4.11.6": "長方形面積的應用題",
      "4.11.7": "正方形面積的計算",
      "4.11.8": "正方形面積的應用題",
      "4.11.9": "面積和周界的題目",
      "4.11.10": "面積的計算",
      "4.11.11": "分割法和填補法",
    },
    12: {
      4.12: {
        en: "More about fractions",
        zh: "進一步認識分數",
      },
      "4.12.1": "認識真分數、假分數和帶分數",
      "4.12.2": "等值的數",
      "4.12.3": "同分母分數的大小比較",
      "4.12.4": "認識擴分和約分",
    },
    13: {
      4.13: {
        en: "Addition & Subtraction of Fractions",
        zh: "分數加減",
      },
      "4.13.1": "同分母分數的加法",
      "4.13.2": "同分母分數的加法應用題",
      "4.13.3": "同分母分數的減法",
      "4.13.4": "同分母分數的減法應用題",
      "4.13.5": "同分母分數的加減混合計算",
      "4.13.6": "同分母分數的加減混合計算應用題",
    },
    14: {
      4.14: {
        en: "Knowing Decimals",
        zh: "小數的認識",
      },
      "4.14.1": "認識小數",
      "4.14.2": "小數的位值",
      "4.14.3": "小數的比較",
      "4.14.4": "小數的應用",
    },
    15: {
      4.15: {
        en: "Addition & Subtraction of Decimals",
        zh: "小數的加減",
      },
      "4.15.1": "小數加法",
      "4.15.2": "小數減法",
      "4.15.3": "小數加法和減法應用題",
      "4.15.4": "小數加減混合計算",
      "4.15.5": "小數加減混合計算應用題",
    },
  },
  5: {
    1: {
      5.1: {
        en: "Multi-digit Numbers",
        zh: "多位數",
      },
      "5.1.1": "認識多位數的概念",
      "5.1.2": "多位數的特性和比較",
      "5.1.3": "多位數的近似值",
      "5.1.4": "以「其中一份」作大數量的估計",
      "5.1.5": "以「分割法」作大數量的估計",
    },
    2: {
      5.2: {
        en: "Areas of Triangle & Quadrilateral",
        zh: "三角形、四邊形的面積",
      },
      "5.2.1": "三角形的底和高",
      "5.2.2": "平行四邊形的底和高",
      "5.2.3": "梯形的底和高",
      "5.2.4": "平行四邊形面積的計算",
      "5.2.5": "三角形面積的計算",
      "5.2.6": "梯形面積的計算",
      "5.2.7": "平行四邊形、三角形和梯形面積的應用題",
    },
    3: {
      5.3: {
        en: "Area of Polygons",
        zh: "多邊形的面積",
      },
      "5.3.1": "利用分割法找出多邊形的面積",
      "5.3.2": "利用填補法找出多邊形的面積",
    },
    4: {
      5.4: {
        en: "Comparing Fractions, Addition & Subtraction of Fractions",
        zh: "分數的比較和加減",
      },
      "5.4.1": "異分母分數的大小比較",
      "5.4.2": "異分母分數的加法",
      "5.4.3": "異分母分數的減法",
      "5.4.4": "異分母分數的加法和減法應用題",
      "5.4.5": "三個異分母分數的加減運算",
      "5.4.6": "三個異分母分數的加法、減法、加減混合應用題",
      "5.4.7": "「部分佔全部」的加減應用題",
    },
    5: {
      5.5: {
        en: "Multiplication of Fractions",
        zh: "分數乘法",
      },
      "5.5.1": "分數乘以整數",
      "5.5.2": "整數乘以分數",
      "5.5.3": "分數乘以分數",
      "5.5.4": "三個數的乘法",
      "5.5.5": "分數乘法應用題",
    },
    6: {
      5.6: {
        en: "Algebraic Expression and Simple Equations (I)",
        zh: "代數式和簡易方程（一）",
      },
      "5.6.1": "認識代數式",
      "5.6.2": "代數式的應用",
      "5.6.3": "認識方程",
      "5.6.4": "解方程",
      "5.6.5": "簡易方程應用題",
    },
    7: {
      5.7: {
        en: "Compound Bar Charts",
        zh: "複合棒形圖",
      },
      "5.7.1": "認識複合棒形圖",
      "5.7.2": "閱讀複合棒形圖",
      "5.7.3": "閱讀數據較大的複合棒形圖",
      "5.7.4": "製作複合棒形圖",
    },
    8: {
      5.8: {
        en: "Circles",
        zh: "圓",
      },
      "5.8.1": "認識圓心",
      "5.8.2": "認識圓周、直徑和半徑",
      "5.8.3": "由圓組成的圖形",
    },
    9: {
      5.9: {
        en: "3-D shapes’ cross-section",
        zh: "立體的截面",
      },
      "5.9.1": "認識角柱和圓柱的截面",
      "5.9.2": "認識角錐和圓錐的截面",
      "5.9.3": "認識球的截面和球的特性",
    },
    10: {
      "5.10": {
        en: "3-D Shapes",
        zh: "立體圖形",
      },
      "5.10.1": "認識立體圖形的稜和頂點",
      "5.10.2": "正方體和長方體",
      "5.10.3": "圓柱的摺紙圖樣",
    },
    11: {
      5.11: {
        en: "Multiplication of Decimals",
        zh: "小數乘法",
      },
      "5.11.1": "小數與整數相乘",
      "5.11.2": "小數乘以小數",
      "5.11.3": "小數的近似值",
      "5.11.4": "小數乘法應用題",
    },
    12: {
      5.12: {
        en: "Division and Mixed Arithmetic Operations of Fractions",
        zh: "分數除法及四則混合計算",
      },
      "5.12.1": "以分數表示兩個整數相除的商",
      "5.12.2": "除數是整數的分數除法",
      "5.12.3": "除數是分數的分數除法",
      "5.12.4": "分數除法應用題",
      "5.12.5": "分數應用題",
      "5.12.6": "三個數的除法",
      "5.12.7": "三個數的四則混合計算",
      "5.12.8": "三個數的四則混合應用題",
    },
    13: {
      5.13: {
        en: "Algebraic Expression and Simple Equations (II)",
        zh: "代數式和簡易方程（二)",
      },
      "5.13.1": "進一步認識代數式",
      "5.13.2": "代數式的應用",
      "5.13.3": "解方程",
      "5.13.4": "簡易方程應用題",
    },
    14: {
      5.14: {
        en: "Volume",
        zh: "體積",
      },
      "5.14.1": "體積的單位",
      "5.14.2": "體積的量度",
      "5.14.3": "長方體和正方體的體積",
      "5.14.4": "由正方體和長方體組成的立體圖形的體積",
      "5.14.5": "體積的應用題",
    },
  },
  6: {
    1: {
      6.1: {
        en: "Division and Mixed Arithmetic Operations of Decimals",
        zh: "小數除法及四則混合計算",
      },
      "6.1.1": "除數是整數",
      "6.1.2": "除數是小數",
      "6.1.3": "把商取近似值",
      "6.1.4": "小數除法應用題",
      "6.1.5": "小數除法應用題的餘數問題",
      "6.1.6": "小數四則混合計算",
      "6.1.7": "涉及圖形面積的小數計算",
      "6.1.8": "小數四則混合計算的應用題",
    },
    2: {
      6.2: {
        en: "Interconversion between Decimals and Fractions",
        zh: "小數和分數互化",
      },
      "6.2.1": "小數化為分數",
      "6.2.2": "分數化為小數",
      "6.2.3": "把分數化為小數作比較",
    },
    3: {
      6.3: {
        en: "Averages",
        zh: "平均數",
      },
      "6.3.1": "認識及計算平均數",
      "6.3.2": "解答應用題",
    },
    4: {
      6.4: {
        en: "Percentage",
        zh: "百分數",
      },
      "6.4.1": "認識百分數",
      "6.4.2": "分數化為百分數",
      "6.4.3": "百分數化為分數",
      "6.4.4": "小數化為百分數",
      "6.4.5": "百分數化為小數",
    },
    5: {
      6.5: {
        en: "Application of Percentage",
        zh: "百分數的應用",
      },
      "6.5.1": "佔全部的百分之幾",
      "6.5.2": "從已知的百分數求數值",
      "6.5.3": "比較、增加和減少",
    },
    6: {
      6.6: {
        en: "Capacity & Volume",
        zh: "容量和體積",
      },
      "6.6.1": "容量和體積的單位及關係",
      "6.6.2": "容量和體積的應用",
      "6.6.3": "排水法",
      "6.6.4": "排水法的應用",
    },
    7: {
      6.7: {
        en: "Circumference",
        zh: "圓周",
      },
      "6.7.1": "圓周的量度",
      "6.7.2": "圓周的計算",
      "6.7.3": "圓周的應用題",
      "6.7.4": "涉及圓的周界計算",
    },
    8: {
      6.8: {
        en: "Area of Circles",
        zh: "圓面積",
      },
      "6.8.1": "圓面積的計算",
      "6.8.2": "圓面積的應用題",
    },
    9: {
      6.9: {
        en: "Angles & Degree",
        zh: "角和度",
      },
      "6.9.1": "進一步認識角",
      "6.9.2": "認識度",
      "6.9.3": "利用量角器來量度角",
      "6.9.4": "繪畫指定大小的角",
    },
    10: {
      "6.10": {
        en: "Pie Charts",
        zh: "圓形圖",
      },
      "6.10.1": "進一步認識圓",
      "6.10.2": "認識圓形圖",
      "6.10.3": "閱讀圓形圖",
    },
    11: {
      6.11: {
        en: "Time and Speed",
        zh: "時間和速率",
      },
      "6.11.1": "時間單位之間的化聚",
      "6.11.2": "過了多久、結束時間",
      "6.11.3": "開始時間",
      "6.11.4": "認識速率",
      "6.11.5": "速率單位",
      "6.11.6": "求速率的應用題",
      "6.11.7": "求路程的應用題",
      "6.11.8": "求時間的應用題",
      "6.11.9": "認識及閱讀行程圖",
      "6.11.10": "多個項目的行程圖",
    },
    12: {
      6.12: {
        en: "Simple Equations",
        zh: "簡易方程",
      },
      "6.12.1": "解包含小數、分數或百分數的方程",
      "6.12.2": "解包含圓括號的方程",
      "6.12.3": "解包含同類項的方程",
      "6.12.4": "解包含小數、分數或百分數的方程應用題",
      "6.12.5": "解涉及同類項的方程應用題",
    },
    13: {
      6.13: {
        en: "Broken Line Graphs",
        zh: "折線圖",
      },
      "6.13.1": "認識及閱讀折線圖",
      "6.13.2": "閱讀多於一組統計資料的折線圖",
      "6.13.3": "製作折線圖",
    },
    14: {
      6.14: {
        en: "Application of Statistical Graphs",
        zh: "統計圖的應用",
      },
      "6.14.1": "選擇合適的統計圖",
      "6.14.2": "統計圖的應用和誤用",
    },
    15: {
      6.15: {
        en: "Axial Symmetry",
        zh: "軸對稱",
      },
      "6.15.1": "認識軸對稱圖形和對稱軸",
      "6.15.2": "找出對稱軸",
      "6.15.3": "畫出軸對稱圖形",
    },
  },
});
